-- [ATTENDANCE 더미 데이터]
TRUNCATE TABLE attendance RESTART IDENTITY CASCADE;

INSERT INTO attendance (attendance_id, member_id, attendance_date)
VALUES
-- 관리자 (1)
(1, 1, '2025-04-01'),
(2, 1, '2025-04-04'),
(3, 1, '2025-04-11'),
(4, 1, '2025-04-18'),
(5, 1, '2025-04-25'),
(6, 1, '2025-05-01'),
(7, 1, '2025-05-02'),
(8, 1, '2025-05-03'),
(9, 1, '2025-05-04'),
(10, 1, '2025-05-05'),
(11, 1, '2025-05-06'),

-- 김지훈 (2)
(12, 2, '2025-04-10'),

-- 이미진 (3)
(13, 3, '2025-04-10'),

-- 박서연 (4)
(14, 4, '2025-04-08'),

-- 김진우 (5)
(15, 5, '2025-04-07');

-- 시퀀스 재설정
SELECT setval('attendance_attendance_id_seq', 15);
